<template>
  <div class="update-log">
    <a-timeline>
      <a-timeline-item v-for="(item, index) in log" :key="index">
        <a-card>
          <h4>{{ item.title }}</h4>
          <ul>
            <li class="detail" v-for="(i, k) in item.detail" :key="k">{{ i }}</li>
          </ul>
        </a-card>
      </a-timeline-item>
    </a-timeline>
  </div>
</template>

<script>
export default {
  data() {
    return {
      log: [
        {
          title: '服务聚合1.8.1',
          detail: [
            '数据适配模块新增更多语法支持',
            '国家组件配置新增认证信息',
            '服务生成添加sql日志',
            '类型管理配置修改',
            '重构了国家组件认证流程，解决了秘钥冲突问题，同时优化了组件性能和操作方式',
            '增加sqlonall查询日志菜单',
            '优化类型管理(层级、业务域由管理员管理，添加默认类型，用户可自行维护自己的类型)',
            '优化了与服务编排的交互方式',
            '优化系统性能',
            '解决其他已知缺陷'
          ]
        },
        {
          title: '服务聚合1.8.0',
          detail: [
            '增加数据适配模块',
            '增加弱口令校验功能',
            '黑白名单配置支持IP段设置',
            '数据适配模块新增黑名单、数据转换功能',
            '登录页显示版本号及版本更新历史',
            '支持国家下发接口变更',
            '国家组件配置增加应用维度',
            '优化服务日志，解决服务日志查询慢的问题',
            '优化系统性能'
          ]
        },
        {
          title: '服务聚合1.7.0',
          detail: ['更新使用手册', '优化服务日志和用户日志', '优化接口统计模块', '新增应用接口统计模块', '节点监控模块新增查看系统日志功能', '支持接口发布前强制测试功能', '解决了其他已知bug']
        },
        {
          title: '服务聚合1.6.0',
          detail: [
            '首页信息界面优化，提升用户友好度',
            '统一接口信息功能入口，简化操作',
            '增加接口类型',
            '增加接口定时下线功能',
            '抽取系统内置定时任务，引入任务调度服务',
            '引入RocketMq消息队列，提高系统在相关业务场景的稳定性和并发性能',
            '解决了其他已知bug'
          ]
        },
        {
          title: '服务聚合1.5.0',
          detail: [
            '系统运维新增网关监控，网关预警功能，帮组用户可以随时查看网关的CPU，内存使用情况',
            '统一接口信息功能入口，简化操作',
            '接口授权增加时间管控功能，可以实现控制接口访问的有效期',
            '新增部门维度接口统计',
            '首页根据登录人角色不同显示不同内容',
            '支持代理接口的数据内容加密',
            '国家组件配置增加部门维度',
            '新增网关工作时间统计',
            '新增甘肃定制报表',
            '用户登录时可以支持手机动态密码登录',
            '站内信增加分类管理',
            '支持目录下发国家接口，同时自动代理',
            '支持目录下发国家接口授权码，自动配置国家组件'
          ]
        },
        {
          title: '服务聚合1.4.0',
          detail: [
            '增加服务巡检功能，自动检测接口健康状态，并且可以配置巡检策略',
            '新增站内信功能，发送接口代理时的异常信息给管理员方便查看',
            '新增接口调用统计，可以通过时间段查看接口的调用次数',
            '新增自定义组件，用户可以根据开发文档开发增强接口功能的jar包，上传至聚合平台后接口挂载组件增强接口功能',
            '优化redis存储结构提升系统性能'
          ]
        }
      ]
    };
  }
};
</script>

<style lang="scss" scoped>
.update-log {
  padding: 10px;
  max-height: 50vh;
  overflow-y: auto;
}
.detail {
  text-indent: 0;
  margin-top: 10px;
}
</style>